//Домашнее задание №2
//Задача 4. Найти среднее арифметическое цифр числа
//На вход подается произвольное четырехзначное число
//Нужно напечатать среднее арифметическое цифр
//Данные на входе: Четырехзначное целое положительное число
//Данные на выходе: Вещественное число в формате %.2f

#include <stdio.h>

int main()
{

  int a, b, c, d, num;
  float average;
  printf("Введите 4-х значное число: ");
  scanf("%d", &num);
     if (999<num && num<10000)
     {
    printf("Среднее арифметическое цифр: \n");
    a=(num-num%1000)/1000;

    b=(num-a*1000-(num%100))/100;

    c=(num-a*1000-b*100-(num%10))/10;

    d=num%10;
    printf("%d%s", d, "\n");
    average = a + b + c + d;
    average /= 4.;
    printf("%.2f\n", average);
  
        return 0;
      };
  printf("число не 4-х значное");
  return 1;
}
